FL0WL0W/EmbeddedIOServices/HardwareAbstractions/Stm32Hal/src/Stm32HalTimer.cpp
#include "Stm32HalTimerService.h"

namespace Stm32
{
	bool _timFrequencyLocked[TimerIndex::Num];
	extern Stm32HalTimerService *_timer[TimerIndex::Num];

	TIM_HandleTypeDef TimInit(TimerIndex index, uint32_t prescaler, uint32_t period)
	{
		EnableTimerInterrupts(index);
		EnableTimerClock(index);
		TIM_TypeDef *TIM = TimIndexToTIM(index);
		
		TIM_HandleTypeDef TIM_HandleStruct;

		//set mode
		TIM_HandleStruct.Instance = TIM;
		TIM_HandleStruct.Init.CounterMode = TIM_COUNTERMODE_UP;
		TIM_HandleStruct.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  		TIM_HandleStruct.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
		TIM_HandleStruct.Init.Prescaler = prescaler;
  		TIM_HandleStruct.Init.Period = period; // autoreload at max
		
		//init
		HAL_TIM_Base_Init(&TIM_HandleStruct);

		//configure clock
		TIM_ClockConfigTypeDef TIM_ClockConfigStruct = {0};
		TIM_ClockConfigStruct.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
		HAL_TIM_ConfigClockSource(&TIM_HandleStruct, &TIM_ClockConfigStruct);

		//start timer
		HAL_TIM_Base_Start(&TIM_HandleStruct);

		return TIM_HandleStruct;
	}

	TIM_TypeDef *TimIndexToTIM(TimerIndex index)
	{
		switch (index)
		{
#ifdef TIM1_BASE
		case TimerIndex::Index1:
			return TIM1;
#endif
#ifdef TIM2_BASE
		case TimerIndex::Index2:
			return TIM2;
#endif
#ifdef TIM3_BASE
		case TimerIndex::Index3:
			return TIM3;
#endif
#ifdef TIM4_BASE
		case TimerIndex::Index4:
			return TIM4;
#endif
#ifdef TIM5_BASE
		case TimerIndex::Index5:
			return TIM5;
#endif
#ifdef TIM6_BASE
		case TimerIndex::Index6:
			return TIM6;
#endif
#ifdef TIM7_BASE
		case TimerIndex::Index7:
			return TIM7;
#endif
#ifdef TIM8_BASE
		case TimerIndex::Index8:
			return TIM8;
#endif
#ifdef TIM9_BASE
		case TimerIndex::Index9:
			return TIM9;
#endif
#ifdef TIM10_BASE
		case TimerIndex::Index10:
			return TIM10;
#endif
#ifdef TIM11_BASE
		case TimerIndex::Index11:
			return TIM11;
#endif
#ifdef TIM12_BASE
		case TimerIndex::Index12:
			return TIM12;
#endif
#ifdef TIM13_BASE
		case TimerIndex::Index13:
			return TIM13;
#endif
#ifdef TIM14_BASE
		case TimerIndex::Index14:
			return TIM14;
#endif
#ifdef TIM15_BASE
		case TimerIndex::Index15:
			return TIM15;
#endif
#ifdef TIM16_BASE
		case TimerIndex::Index16:
			return TIM16;
#endif
#ifdef TIM17_BASE
		case TimerIndex::Index17:
			return TIM17;
#endif
#ifdef TIM18_BASE
		case TimerIndex::Index18:
			return TIM18;
#endif
#ifdef TIM19_BASE
		case TimerIndex::Index19:
			return TIM19;
#endif
#ifdef TIM20_BASE
		case TimerIndex::Index20:
			return TIM20;
#endif
#ifdef TIM21_BASE
		case TimerIndex::Index21:
			return TIM21;
#endif
#ifdef TIM22_BASE
		case TimerIndex::Index22:
			return TIM22;
#endif
		}
	}
    void EnableTimerClock(TimerIndex index)
    {
		switch (index)
		{
#ifdef TIM1_BASE
		case TimerIndex::Index1:
			__HAL_RCC_TIM1_CLK_ENABLE();
			break;
#endif
#ifdef TIM2_BASE
		case TimerIndex::Index2:
			__HAL_RCC_TIM2_CLK_ENABLE();
			break;
#endif
#ifdef TIM3_BASE
		case TimerIndex::Index3:
			__HAL_RCC_TIM3_CLK_ENABLE();
			break;
#endif
#ifdef TIM4_BASE
		case TimerIndex::Index4:
			__HAL_RCC_TIM4_CLK_ENABLE();
			break;
#endif
#ifdef TIM5_BASE
		case TimerIndex::Index5:
			__HAL_RCC_TIM5_CLK_ENABLE();
			break;
#endif
#ifdef TIM6_BASE
		case TimerIndex::Index6:
			__HAL_RCC_TIM6_CLK_ENABLE();
			break;
#endif
#ifdef TIM7_BASE
		case TimerIndex::Index7:
			__HAL_RCC_TIM7_CLK_ENABLE();
			break;
#endif
#ifdef TIM8_BASE
		case TimerIndex::Index8:
			__HAL_RCC_TIM8_CLK_ENABLE();
			break;
#endif
#ifdef TIM9_BASE
		case TimerIndex::Index9:
			__HAL_RCC_TIM9_CLK_ENABLE();
			break;
#endif
#ifdef TIM10_BASE
		case TimerIndex::Index10:
			__HAL_RCC_TIM10_CLK_ENABLE();
			break;
#endif
#ifdef TIM11_BASE
		case TimerIndex::Index11:
			__HAL_RCC_TIM11_CLK_ENABLE();
			break;
#endif
#ifdef TIM12_BASE
		case TimerIndex::Index12:
			__HAL_RCC_TIM12_CLK_ENABLE();
			break;
#endif
#ifdef TIM13_BASE
		case TimerIndex::Index13:
			__HAL_RCC_TIM13_CLK_ENABLE();
			break;
#endif
#ifdef TIM15_BASE
		case TimerIndex::Index15:
			__HAL_RCC_TIM15_CLK_ENABLE();
			break;
#endif
#ifdef TIM16_BASE
		case TimerIndex::Index16:
			__HAL_RCC_TIM16_CLK_ENABLE();
			break;
#endif
#ifdef TIM17_BASE
		case TimerIndex::Index17:
			__HAL_RCC_TIM17_CLK_ENABLE();
			break;
#endif
#ifdef TIM18_BASE
		case TimerIndex::Index18:
			__HAL_RCC_TIM18_CLK_ENABLE();
			break;
#endif
#ifdef TIM19_BASE
		case TimerIndex::Index19:
			__HAL_RCC_TIM19_CLK_ENABLE();
			break;
#endif
#ifdef TIM20_BASE
		case TimerIndex::Index20:
			__HAL_RCC_TIM20_CLK_ENABLE();
			break;
#endif
#ifdef TIM21_BASE
		case TimerIndex::Index21:
			__HAL_RCC_TIM21_CLK_ENABLE();
			break;
#endif
#ifdef TIM22_BASE
		case TimerIndex::Index22:
			__HAL_RCC_TIM22_CLK_ENABLE();
			break;
#endif
		}
    }

    void EnableTimerInterrupts(TimerIndex index)
	{
		switch (index)
		{
#ifdef TIM1_BASE
		case TimerIndex::Index1:
			HAL_NVIC_SetPriority(TIM1_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM1_CC_IRQn);
			break;
#endif
#ifdef TIM2_BASE
		case TimerIndex::Index2:
			HAL_NVIC_SetPriority(TIM2_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM2_CC_IRQn);
			break;
#endif
#ifdef TIM3_BASE
		case TimerIndex::Index3:
			HAL_NVIC_SetPriority(TIM3_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM3_CC_IRQn);
			break;
#endif
#ifdef TIM4_BASE
		case TimerIndex::Index4:
			HAL_NVIC_SetPriority(TIM4_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM4_CC_IRQn);
			break;
#endif
#ifdef TIM5_BASE
		case TimerIndex::Index5:
			HAL_NVIC_SetPriority(TIM5_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM5_CC_IRQn);
			break;
#endif
#ifdef TIM6_BASE
		case TimerIndex::Index6:
			HAL_NVIC_SetPriority(TIM6_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM6_CC_IRQn);
			break;
#endif
#ifdef TIM7_BASE
		case TimerIndex::Index7:
			HAL_NVIC_SetPriority(TIM7_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM7_CC_IRQn);
			break;
#endif
#ifdef TIM8_BASE
		case TimerIndex::Index8:
			HAL_NVIC_SetPriority(TIM8_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM8_CC_IRQn);
			break;
#endif
#ifdef TIM9_BASE
		case TimerIndex::Index9:
			HAL_NVIC_SetPriority(TIM9_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM9_CC_IRQn);
			break;
#endif
#ifdef TIM10_BASE
		case TimerIndex::Index10:
			HAL_NVIC_SetPriority(TIM10_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM10_CC_IRQn);
			break;
#endif
#ifdef TIM11_BASE
		case TimerIndex::Index11:
			HAL_NVIC_SetPriority(TIM11_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM11_CC_IRQn);
			break;
#endif
#ifdef TIM12_BASE
		case TimerIndex::Index12:
			HAL_NVIC_SetPriority(TIM12_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM12_CC_IRQn);
			break;
#endif
#ifdef TIM13_BASE
		case TimerIndex::Index13:
			HAL_NVIC_SetPriority(TIM13_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM13_CC_IRQn);
			break;
#endif
#ifdef TIM14_BASE
		case TimerIndex::Index14:
			HAL_NVIC_SetPriority(TIM14_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM14_CC_IRQn);
			break;
#endif
#ifdef TIM15_BASE
		case TimerIndex::Index15:
			HAL_NVIC_SetPriority(TIM15_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM15_CC_IRQn);
			break;
#endif
#ifdef TIM16_BASE
		case TimerIndex::Index16:
			HAL_NVIC_SetPriority(TIM16_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM16_CC_IRQn);
			break;
#endif
#ifdef TIM17_BASE
		case TimerIndex::Index17:
			HAL_NVIC_SetPriority(TIM17_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM17_CC_IRQn);
			break;
#endif
#ifdef TIM18_BASE
		case TimerIndex::Index18:
			HAL_NVIC_SetPriority(TIM18_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM18_CC_IRQn);
			break;
#endif
#ifdef TIM19_BASE
		case TimerIndex::Index19:
			HAL_NVIC_SetPriority(TIM19_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM19_CC_IRQn);
			break;
#endif
#ifdef TIM20_BASE
		case TimerIndex::Index20:
			HAL_NVIC_SetPriority(TIM20_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM20_CC_IRQn);
			break;
#endif
#ifdef TIM21_BASE
		case TimerIndex::Index21:
			HAL_NVIC_SetPriority(TIM21_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM21_CC_IRQn);
			break;
#endif
#ifdef TIM22_BASE
		case TimerIndex::Index22:
			HAL_NVIC_SetPriority(TIM22_CC_IRQn, 1, 0);
    		HAL_NVIC_EnableIRQ(TIM22_CC_IRQn);
			break;
#endif
		}
	}

