FL0WL0W/EmbeddedIOServices/HardwareAbstractions/Stm32Hal/src/Stm32HalTimer.cpp
	extern "C" 
	{
		uint16_t _timPreviousCC[TimerIndex::Num][4];
		uint16_t _timCurrentCC[TimerIndex::Num][4];
#ifdef TIM1_BASE
		void TIM1_CC_IRQHandler(void)
		{
			if (TIM1->SR & TIM_IT_CC1)
			{
				TIM1->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index1] != 0)
					_timer[TimerIndex::Index1]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index1][0] = _timCurrentCC[TimerIndex::Index1][0];
				_timCurrentCC[TimerIndex::Index1][0] = TIM1->CCR1;
			}
			if (TIM1->SR & TIM_IT_CC2)
			{
				TIM1->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index1][1] = _timCurrentCC[TimerIndex::Index1][1];
				_timCurrentCC[TimerIndex::Index1][1] = TIM1->CCR2;
			}
			if (TIM1->SR & TIM_IT_CC3)
			{
				TIM1->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index1][2] = _timCurrentCC[TimerIndex::Index1][2];
				_timCurrentCC[TimerIndex::Index1][2] = TIM1->CCR3;
			}
			if (TIM1->SR & TIM_IT_CC4)
			{
				TIM1->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index1][3] = _timCurrentCC[TimerIndex::Index1][3];
				_timCurrentCC[TimerIndex::Index1][3] = TIM1->CCR4;
			}
		}
#endif
#ifdef TIM2_BASE
		void TIM2_CC_IRQHandler(void)
		{
			if (TIM2->SR & TIM_IT_CC1)
			{
				TIM2->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index2] != 0)
					_timer[TimerIndex::Index2]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index2][0] = _timCurrentCC[TimerIndex::Index2][0];
				_timCurrentCC[TimerIndex::Index2][0] = TIM2->CCR1;
			}
			if (TIM2->SR & TIM_IT_CC2)
			{
				TIM2->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index2][1] = _timCurrentCC[TimerIndex::Index2][1];
				_timCurrentCC[TimerIndex::Index2][1] = TIM2->CCR2;
			}
			if (TIM2->SR & TIM_IT_CC3)
			{
				TIM2->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index2][2] = _timCurrentCC[TimerIndex::Index2][2];
				_timCurrentCC[TimerIndex::Index2][2] = TIM2->CCR3;
			}
			if (TIM2->SR & TIM_IT_CC4)
			{
				TIM2->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index2][3] = _timCurrentCC[TimerIndex::Index2][3];
				_timCurrentCC[TimerIndex::Index2][3] = TIM2->CCR4;
			}
		}
#endif
#ifdef TIM3_BASE
		void TIM3_CC_IRQHandler(void)
		{
			if (TIM3->SR & TIM_IT_CC1)
			{
				TIM3->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index3] != 0)
					_timer[TimerIndex::Index3]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index3][0] = _timCurrentCC[TimerIndex::Index3][0];
				_timCurrentCC[TimerIndex::Index3][0] = TIM3->CCR1;
			}
			if (TIM3->SR & TIM_IT_CC2)
			{
				TIM3->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index3][1] = _timCurrentCC[TimerIndex::Index3][1];
				_timCurrentCC[TimerIndex::Index3][1] = TIM3->CCR2;
			}
			if (TIM3->SR & TIM_IT_CC3)
			{
				TIM3->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index3][2] = _timCurrentCC[TimerIndex::Index3][2];
				_timCurrentCC[TimerIndex::Index3][2] = TIM3->CCR3;
			}
			if (TIM3->SR & TIM_IT_CC4)
			{
				TIM3->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index3][3] = _timCurrentCC[TimerIndex::Index3][3];
				_timCurrentCC[TimerIndex::Index3][3] = TIM3->CCR4;
			}
		}
#endif
#ifdef TIM4_BASE
		void TIM4_CC_IRQHandler(void)
		{
			if (TIM4->SR & TIM_IT_CC1)
			{
				TIM4->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index4] != 0)
					_timer[TimerIndex::Index4]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index4][0] = _timCurrentCC[TimerIndex::Index4][0];
				_timCurrentCC[TimerIndex::Index4][0] = TIM4->CCR1;
			}
			if (TIM4->SR & TIM_IT_CC2)
			{
				TIM4->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index4][1] = _timCurrentCC[TimerIndex::Index4][1];
				_timCurrentCC[TimerIndex::Index4][1] = TIM4->CCR2;
			}
			if (TIM4->SR & TIM_IT_CC3)
			{
				TIM4->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index4][2] = _timCurrentCC[TimerIndex::Index4][2];
				_timCurrentCC[TimerIndex::Index4][2] = TIM4->CCR3;
			}
			if (TIM4->SR & TIM_IT_CC4)
			{
				TIM4->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index4][3] = _timCurrentCC[TimerIndex::Index4][3];
				_timCurrentCC[TimerIndex::Index4][3] = TIM4->CCR4;
			}
		}
#endif
#ifdef TIM5_BASE
		void TIM5_CC_IRQHandler(void)
		{
			if (TIM5->SR & TIM_IT_CC1)
			{
				TIM5->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index5] != 0)
					_timer[TimerIndex::Index5]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index5][0] = _timCurrentCC[TimerIndex::Index5][0];
				_timCurrentCC[TimerIndex::Index5][0] = TIM5->CCR1;
			}
			if (TIM5->SR & TIM_IT_CC2)
			{
				TIM5->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index5][1] = _timCurrentCC[TimerIndex::Index5][1];
				_timCurrentCC[TimerIndex::Index5][1] = TIM5->CCR2;
			}
			if (TIM5->SR & TIM_IT_CC3)
			{
				TIM5->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index5][2] = _timCurrentCC[TimerIndex::Index5][2];
				_timCurrentCC[TimerIndex::Index5][2] = TIM5->CCR3;
			}
			if (TIM5->SR & TIM_IT_CC4)
			{
				TIM5->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index5][3] = _timCurrentCC[TimerIndex::Index5][3];
				_timCurrentCC[TimerIndex::Index5][3] = TIM5->CCR4;
			}
		}
#endif
#ifdef TIM6_BASE
		void TIM6_CC_IRQHandler(void)
		{
			if (TIM6->SR & TIM_IT_CC1)
			{
				TIM6->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index6] != 0)
					_timer[TimerIndex::Index6]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index6][0] = _timCurrentCC[TimerIndex::Index6][0];
				_timCurrentCC[TimerIndex::Index6][0] = TIM6->CCR1;
			}
			if (TIM6->SR & TIM_IT_CC2)
			{
				TIM6->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index6][1] = _timCurrentCC[TimerIndex::Index6][1];
				_timCurrentCC[TimerIndex::Index6][1] = TIM6->CCR2;
			}
			if (TIM6->SR & TIM_IT_CC3)
			{
				TIM6->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index6][2] = _timCurrentCC[TimerIndex::Index6][2];
				_timCurrentCC[TimerIndex::Index6][2] = TIM6->CCR3;
			}
			if (TIM6->SR & TIM_IT_CC4)
			{
				TIM6->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index6][3] = _timCurrentCC[TimerIndex::Index6][3];
				_timCurrentCC[TimerIndex::Index6][3] = TIM6->CCR4;
			}
		}
#endif
#ifdef TIM7_BASE
		void TIM7_CC_IRQHandler(void)
		{
			if (TIM7->SR & TIM_IT_CC1)
			{
				TIM7->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index7] != 0)
					_timer[TimerIndex::Index7]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index7][0] = _timCurrentCC[TimerIndex::Index7][0];
				_timCurrentCC[TimerIndex::Index7][0] = TIM7->CCR1;
			}
			if (TIM7->SR & TIM_IT_CC2)
			{
				TIM7->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index7][1] = _timCurrentCC[TimerIndex::Index7][1];
				_timCurrentCC[TimerIndex::Index7][1] = TIM7->CCR2;
			}
			if (TIM7->SR & TIM_IT_CC3)
			{
				TIM7->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index7][2] = _timCurrentCC[TimerIndex::Index7][2];
				_timCurrentCC[TimerIndex::Index7][2] = TIM7->CCR3;
			}
			if (TIM7->SR & TIM_IT_CC4)
			{
				TIM7->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index7][3] = _timCurrentCC[TimerIndex::Index7][3];
				_timCurrentCC[TimerIndex::Index7][3] = TIM7->CCR4;
			}
		}
#endif
#ifdef TIM8_BASE
		void TIM8_CC_IRQHandler(void)
		{
			if (TIM8->SR & TIM_IT_CC1)
			{
				TIM8->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index8] != 0)
					_timer[TimerIndex::Index8]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index8][0] = _timCurrentCC[TimerIndex::Index8][0];
				_timCurrentCC[TimerIndex::Index8][0] = TIM8->CCR1;
			}
			if (TIM8->SR & TIM_IT_CC2)
			{
				TIM8->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index8][1] = _timCurrentCC[TimerIndex::Index8][1];
				_timCurrentCC[TimerIndex::Index8][1] = TIM8->CCR2;
			}
			if (TIM8->SR & TIM_IT_CC3)
			{
				TIM8->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index8][2] = _timCurrentCC[TimerIndex::Index8][2];
				_timCurrentCC[TimerIndex::Index8][2] = TIM8->CCR3;
			}
			if (TIM8->SR & TIM_IT_CC4)
			{
				TIM8->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index8][3] = _timCurrentCC[TimerIndex::Index8][3];
				_timCurrentCC[TimerIndex::Index8][3] = TIM8->CCR4;
			}
		}
#endif
#ifdef TIM9_BASE
		void TIM9_CC_IRQHandler(void)
		{
			if (TIM9->SR & TIM_IT_CC1)
			{
				TIM9->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index9] != 0)
					_timer[TimerIndex::Index9]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index9][0] = _timCurrentCC[TimerIndex::Index9][0];
				_timCurrentCC[TimerIndex::Index9][0] = TIM9->CCR1;
			}
			if (TIM9->SR & TIM_IT_CC2)
			{
				TIM9->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index9][1] = _timCurrentCC[TimerIndex::Index9][1];
				_timCurrentCC[TimerIndex::Index9][1] = TIM9->CCR2;
			}
			if (TIM9->SR & TIM_IT_CC3)
			{
				TIM9->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index9][2] = _timCurrentCC[TimerIndex::Index9][2];
				_timCurrentCC[TimerIndex::Index9][2] = TIM9->CCR3;
			}
			if (TIM9->SR & TIM_IT_CC4)
			{
				TIM9->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index9][3] = _timCurrentCC[TimerIndex::Index9][3];
				_timCurrentCC[TimerIndex::Index9][3] = TIM9->CCR4;
			}
		}
#endif
#ifdef TIM10_BASE
		void TIM10_CC_IRQHandler(void)
		{
			if (TIM10->SR & TIM_IT_CC1)
			{
				TIM10->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index10] != 0)
					_timer[TimerIndex::Index10]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index10][0] = _timCurrentCC[TimerIndex::Index10][0];
				_timCurrentCC[TimerIndex::Index10][0] = TIM10->CCR1;
			}
			if (TIM10->SR & TIM_IT_CC2)
			{
				TIM10->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index10][1] = _timCurrentCC[TimerIndex::Index10][1];
				_timCurrentCC[TimerIndex::Index10][1] = TIM10->CCR2;
			}
			if (TIM10->SR & TIM_IT_CC3)
			{
				TIM10->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index10][2] = _timCurrentCC[TimerIndex::Index10][2];
				_timCurrentCC[TimerIndex::Index10][2] = TIM10->CCR3;
			}
			if (TIM10->SR & TIM_IT_CC4)
			{
				TIM10->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index10][3] = _timCurrentCC[TimerIndex::Index10][3];
				_timCurrentCC[TimerIndex::Index10][3] = TIM10->CCR4;
			}
		}
#endif
#ifdef TIM11_BASE
		void TIM11_CC_IRQHandler(void)
		{
			if (TIM11->SR & TIM_IT_CC1)
			{
				TIM11->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index11] != 0)
					_timer[TimerIndex::Index11]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index11][0] = _timCurrentCC[TimerIndex::Index11][0];
				_timCurrentCC[TimerIndex::Index11][0] = TIM11->CCR1;
			}
			if (TIM11->SR & TIM_IT_CC2)
			{
				TIM11->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index11][1] = _timCurrentCC[TimerIndex::Index11][1];
				_timCurrentCC[TimerIndex::Index11][1] = TIM11->CCR2;
			}
			if (TIM11->SR & TIM_IT_CC3)
			{
				TIM11->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index11][2] = _timCurrentCC[TimerIndex::Index11][2];
				_timCurrentCC[TimerIndex::Index11][2] = TIM11->CCR3;
			}
			if (TIM11->SR & TIM_IT_CC4)
			{
				TIM11->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index11][3] = _timCurrentCC[TimerIndex::Index11][3];
				_timCurrentCC[TimerIndex::Index11][3] = TIM11->CCR4;
			}
		}
#endif
#ifdef TIM12_BASE
		void TIM12_CC_IRQHandler(void)
		{
			if (TIM12->SR & TIM_IT_CC1)
			{
				TIM12->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index12] != 0)
					_timer[TimerIndex::Index12]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index12][0] = _timCurrentCC[TimerIndex::Index12][0];
				_timCurrentCC[TimerIndex::Index12][0] = TIM12->CCR1;
			}
			if (TIM12->SR & TIM_IT_CC2)
			{
				TIM12->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index12][1] = _timCurrentCC[TimerIndex::Index12][1];
				_timCurrentCC[TimerIndex::Index12][1] = TIM12->CCR2;
			}
			if (TIM12->SR & TIM_IT_CC3)
			{
				TIM12->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index12][2] = _timCurrentCC[TimerIndex::Index12][2];
				_timCurrentCC[TimerIndex::Index12][2] = TIM12->CCR3;
			}
			if (TIM12->SR & TIM_IT_CC4)
			{
				TIM12->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index12][3] = _timCurrentCC[TimerIndex::Index12][3];
				_timCurrentCC[TimerIndex::Index12][3] = TIM12->CCR4;
			}
		}
#endif
#ifdef TIM13_BASE
		void TIM13_CC_IRQHandler(void)
		{
			if (TIM13->SR & TIM_IT_CC1)
			{
				TIM13->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index13] != 0)
					_timer[TimerIndex::Index13]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index13][0] = _timCurrentCC[TimerIndex::Index13][0];
				_timCurrentCC[TimerIndex::Index13][0] = TIM13->CCR1;
			}
			if (TIM13->SR & TIM_IT_CC2)
			{
				TIM13->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index13][1] = _timCurrentCC[TimerIndex::Index13][1];
				_timCurrentCC[TimerIndex::Index13][1] = TIM13->CCR2;
			}
			if (TIM13->SR & TIM_IT_CC3)
			{
				TIM13->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index13][2] = _timCurrentCC[TimerIndex::Index13][2];
				_timCurrentCC[TimerIndex::Index13][2] = TIM13->CCR3;
			}
			if (TIM13->SR & TIM_IT_CC4)
			{
				TIM13->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index13][3] = _timCurrentCC[TimerIndex::Index13][3];
				_timCurrentCC[TimerIndex::Index13][3] = TIM13->CCR4;
			}
		}
#endif
#ifdef TIM14_BASE
		void TIM14_CC_IRQHandler(void)
		{
			if (TIM14->SR & TIM_IT_CC1)
			{
				TIM14->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index14] != 0)
					_timer[TimerIndex::Index14]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index14][0] = _timCurrentCC[TimerIndex::Index14][0];
				_timCurrentCC[TimerIndex::Index14][0] = TIM14->CCR1;
			}
			if (TIM14->SR & TIM_IT_CC2)
			{
				TIM14->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index14][1] = _timCurrentCC[TimerIndex::Index14][1];
				_timCurrentCC[TimerIndex::Index14][1] = TIM14->CCR2;
			}
			if (TIM14->SR & TIM_IT_CC3)
			{
				TIM14->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index14][2] = _timCurrentCC[TimerIndex::Index14][2];
				_timCurrentCC[TimerIndex::Index14][2] = TIM14->CCR3;
			}
			if (TIM14->SR & TIM_IT_CC4)
			{
				TIM14->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index14][3] = _timCurrentCC[TimerIndex::Index14][3];
				_timCurrentCC[TimerIndex::Index14][3] = TIM14->CCR4;
			}
		}
#endif
#ifdef TIM15_BASE
		void TIM15_CC_IRQHandler(void)
		{
			if (TIM15->SR & TIM_IT_CC1)
			{
				TIM15->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index15] != 0)
					_timer[TimerIndex::Index15]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index15][0] = _timCurrentCC[TimerIndex::Index15][0];
				_timCurrentCC[TimerIndex::Index15][0] = TIM15->CCR1;
			}
			if (TIM15->SR & TIM_IT_CC2)
			{
				TIM15->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index15][1] = _timCurrentCC[TimerIndex::Index15][1];
				_timCurrentCC[TimerIndex::Index15][1] = TIM15->CCR2;
			}
			if (TIM15->SR & TIM_IT_CC3)
			{
				TIM15->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index15][2] = _timCurrentCC[TimerIndex::Index15][2];
				_timCurrentCC[TimerIndex::Index15][2] = TIM15->CCR3;
			}
			if (TIM15->SR & TIM_IT_CC4)
			{
				TIM15->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index15][3] = _timCurrentCC[TimerIndex::Index15][3];
				_timCurrentCC[TimerIndex::Index15][3] = TIM15->CCR4;
			}
		}
#endif
#ifdef TIM16_BASE
		void TIM16_CC_IRQHandler(void)
		{
			if (TIM16->SR & TIM_IT_CC1)
			{
				TIM16->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index16] != 0)
					_timer[TimerIndex::Index16]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index16][0] = _timCurrentCC[TimerIndex::Index16][0];
				_timCurrentCC[TimerIndex::Index16][0] = TIM16->CCR1;
			}
			if (TIM16->SR & TIM_IT_CC2)
			{
				TIM16->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index16][1] = _timCurrentCC[TimerIndex::Index16][1];
				_timCurrentCC[TimerIndex::Index16][1] = TIM16->CCR2;
			}
			if (TIM16->SR & TIM_IT_CC3)
			{
				TIM16->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index16][2] = _timCurrentCC[TimerIndex::Index16][2];
				_timCurrentCC[TimerIndex::Index16][2] = TIM16->CCR3;
			}
			if (TIM16->SR & TIM_IT_CC4)
			{
				TIM16->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index16][3] = _timCurrentCC[TimerIndex::Index16][3];
				_timCurrentCC[TimerIndex::Index16][3] = TIM16->CCR4;
			}
		}
#endif
#ifdef TIM17_BASE
		void TIM17_CC_IRQHandler(void)
		{
			if (TIM17->SR & TIM_IT_CC1)
			{
				TIM17->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index17] != 0)
					_timer[TimerIndex::Index17]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index17][0] = _timCurrentCC[TimerIndex::Index17][0];
				_timCurrentCC[TimerIndex::Index17][0] = TIM17->CCR1;
			}
			if (TIM17->SR & TIM_IT_CC2)
			{
				TIM17->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index17][1] = _timCurrentCC[TimerIndex::Index17][1];
				_timCurrentCC[TimerIndex::Index17][1] = TIM17->CCR2;
			}
			if (TIM17->SR & TIM_IT_CC3)
			{
				TIM17->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index17][2] = _timCurrentCC[TimerIndex::Index17][2];
				_timCurrentCC[TimerIndex::Index17][2] = TIM17->CCR3;
			}
			if (TIM17->SR & TIM_IT_CC4)
			{
				TIM17->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index17][3] = _timCurrentCC[TimerIndex::Index17][3];
				_timCurrentCC[TimerIndex::Index17][3] = TIM17->CCR4;
			}
		}
#endif
#ifdef TIM18_BASE
		void TIM18_CC_IRQHandler(void)
		{
			if (TIM18->SR & TIM_IT_CC1)
			{
				TIM18->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index18] != 0)
					_timer[TimerIndex::Index18]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index18][0] = _timCurrentCC[TimerIndex::Index18][0];
				_timCurrentCC[TimerIndex::Index18][0] = TIM18->CCR1;
			}
			if (TIM18->SR & TIM_IT_CC2)
			{
				TIM18->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index18][1] = _timCurrentCC[TimerIndex::Index18][1];
				_timCurrentCC[TimerIndex::Index18][1] = TIM18->CCR2;
			}
			if (TIM18->SR & TIM_IT_CC3)
			{
				TIM18->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index18][2] = _timCurrentCC[TimerIndex::Index18][2];
				_timCurrentCC[TimerIndex::Index18][2] = TIM18->CCR3;
			}
			if (TIM18->SR & TIM_IT_CC4)
			{
				TIM18->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index18][3] = _timCurrentCC[TimerIndex::Index18][3];
				_timCurrentCC[TimerIndex::Index18][3] = TIM18->CCR4;
			}
		}
#endif
#ifdef TIM19_BASE
		void TIM19_CC_IRQHandler(void)
		{
			if (TIM19->SR & TIM_IT_CC1)
			{
				TIM19->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index19] != 0)
					_timer[TimerIndex::Index19]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index19][0] = _timCurrentCC[TimerIndex::Index19][0];
				_timCurrentCC[TimerIndex::Index19][0] = TIM19->CCR1;
			}
			if (TIM19->SR & TIM_IT_CC2)
			{
				TIM19->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index19][1] = _timCurrentCC[TimerIndex::Index19][1];
				_timCurrentCC[TimerIndex::Index19][1] = TIM19->CCR2;
			}
			if (TIM19->SR & TIM_IT_CC3)
			{
				TIM19->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index19][2] = _timCurrentCC[TimerIndex::Index19][2];
				_timCurrentCC[TimerIndex::Index19][2] = TIM19->CCR3;
			}
			if (TIM19->SR & TIM_IT_CC4)
			{
				TIM19->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index19][3] = _timCurrentCC[TimerIndex::Index19][3];
				_timCurrentCC[TimerIndex::Index19][3] = TIM19->CCR4;
			}
		}
#endif
#ifdef TIM20_BASE
		void TIM20_CC_IRQHandler(void)
		{
			if (TIM20->SR & TIM_IT_CC1)
			{
				TIM20->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index20] != 0)
					_timer[TimerIndex::Index20]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index20][0] = _timCurrentCC[TimerIndex::Index20][0];
				_timCurrentCC[TimerIndex::Index20][0] = TIM20->CCR1;
			}
			if (TIM20->SR & TIM_IT_CC2)
			{
				TIM20->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index20][1] = _timCurrentCC[TimerIndex::Index20][1];
				_timCurrentCC[TimerIndex::Index20][1] = TIM20->CCR2;
			}
			if (TIM20->SR & TIM_IT_CC3)
			{
				TIM20->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index20][2] = _timCurrentCC[TimerIndex::Index20][2];
				_timCurrentCC[TimerIndex::Index20][2] = TIM20->CCR3;
			}
			if (TIM20->SR & TIM_IT_CC4)
			{
				TIM20->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index20][3] = _timCurrentCC[TimerIndex::Index20][3];
				_timCurrentCC[TimerIndex::Index20][3] = TIM20->CCR4;
			}
		}
#endif
#ifdef TIM21_BASE
		void TIM21_CC_IRQHandler(void)
		{
			if (TIM21->SR & TIM_IT_CC1)
			{
				TIM21->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index21] != 0)
					_timer[TimerIndex::Index21]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index21][0] = _timCurrentCC[TimerIndex::Index21][0];
				_timCurrentCC[TimerIndex::Index21][0] = TIM21->CCR1;
			}
			if (TIM21->SR & TIM_IT_CC2)
			{
				TIM21->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index21][1] = _timCurrentCC[TimerIndex::Index21][1];
				_timCurrentCC[TimerIndex::Index21][1] = TIM21->CCR2;
			}
			if (TIM21->SR & TIM_IT_CC3)
			{
				TIM21->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index21][2] = _timCurrentCC[TimerIndex::Index21][2];
				_timCurrentCC[TimerIndex::Index21][2] = TIM21->CCR3;
			}
			if (TIM21->SR & TIM_IT_CC4)
			{
				TIM21->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index21][3] = _timCurrentCC[TimerIndex::Index21][3];
				_timCurrentCC[TimerIndex::Index21][3] = TIM21->CCR4;
			}
		}
#endif
#ifdef TIM22_BASE
		void TIM22_CC_IRQHandler(void)
		{
			if (TIM22->SR & TIM_IT_CC1)
			{
				TIM22->SR = ~TIM_IT_CC1;
				if (_timer[TimerIndex::Index22] != 0)
					_timer[TimerIndex::Index22]->TimerInterrupt();
				_timPreviousCC[TimerIndex::Index22][0] = _timCurrentCC[TimerIndex::Index22][0];
				_timCurrentCC[TimerIndex::Index22][0] = TIM22->CCR1;
			}
			if (TIM22->SR & TIM_IT_CC2)
			{
				TIM22->SR = ~TIM_IT_CC2;
				_timPreviousCC[TimerIndex::Index22][1] = _timCurrentCC[TimerIndex::Index22][1];
				_timCurrentCC[TimerIndex::Index22][1] = TIM22->CCR2;
			}
			if (TIM22->SR & TIM_IT_CC3)
			{
				TIM22->SR = ~TIM_IT_CC3;
				_timPreviousCC[TimerIndex::Index22][2] = _timCurrentCC[TimerIndex::Index22][2];
				_timCurrentCC[TimerIndex::Index22][2] = TIM22->CCR3;
			}
			if (TIM22->SR & TIM_IT_CC4)
			{
				TIM22->SR = ~TIM_IT_CC4;
				_timPreviousCC[TimerIndex::Index22][3] = _timCurrentCC[TimerIndex::Index22][3];
				_timCurrentCC[TimerIndex::Index22][3] = TIM22->CCR4;
			}
		}
#endif
	}
}